{
   "2017-07-26-ways-to-resolve-smearing-smudging-streaking-melting-and-artifacts": {
      "date": "2017-07-26 16:19:04",
      "id": "2017-07-26-ways-to-resolve-smearing-smudging-streaking-melting-and-artifacts",
      "page__heading": "<h1 class=\"page__heading\">\n    Ways to resolve smearing, smudging, streaking, melting, and artifacts\n</h1>",
      "title": "\n    Ways to resolve smearing, smudging, streaking, melting, and artifacts\n",
      "page__opening": "<p class=\"page__opening\">\n    This is known to affect H.264 streams over UDP.\n</p>",
      "page__byline": "",
      "page__content": "<h2 id=\"learn\">\n    Update FFMPEG\n</h2>\n<p>\n    You should be on FFMPEG 3.x or greater for the best performance.\n</p>\n<h2>\n    Try these settings\n</h2>\n<p>\n    Generally a lot can be cleared up when using TCP instead of UDP. Also by increasing the duration to wait for data we can allow the camera a chance to complete a stream from long distances or poor connections.\n</p>\n<ol>\n    <li>\n        <b>RTSP Transport</b> : TCP\n    </li>\n    <li>\n        <b>Analyzation Duration</b> : 1000000\n    </li>\n    <li>\n        <b>Probe Size</b> : 1000000\n    </li>\n</ol>\n<h2>\n    Got an RTSP camera?\n</h2>\n<p>\n    See&nbsp;<a href=\"/articles/2017-07-29-how-i-optimized-my-rtsp-camera\">How I optimized my RTSP camera</a>&nbsp;settings in Shinobi.\n</p>"
   },
   "2017-07-26-how-to-update-nodejs-and-npm": {
      "date": "2017-07-26 18:17:16",
      "id": "2017-07-26-how-to-update-nodejs-and-npm",
      "page__heading": "<h1 class=\"page__heading\">\n    How to Update Node.js and NPM\n</h1>",
      "title": "\n    How to Update Node.js and NPM\n",
      "page__opening": "<p class=\"page__opening\">\n    Node.js 7.2 or higher is required to run Shinobi\n</p>",
      "page__content": "<h2 id=\"learn\">\n    Updating Node.js\n</h2>\n<pre>sudo npm cache clean -f\nsudo npm install -g n\nsudo n stable</pre>\n<h2>\n    Updating NPM\n</h2>\n<pre>sudo npm install npm -g</pre>"
   },
   "2017-07-26-module-not-found": {
      "date": "2017-07-26 18:26:09",
      "id": "2017-07-26-module-not-found",
      "page__heading": "<h1 class=\"page__heading\">\n    Module not found\n</h1>",
      "title": "\n    Module not found\n",
      "page__opening": "<p class=\"page__opening\">\n    Shinobi requires the installation of modules to run\n</p>",
      "page__content": "<h2 id=\"learn\">\n    Installing modules\n</h2>\n<p>\n    Navigate to your Shinobi directory and run the following command to install modules.\n</p>\n<pre>npm install</pre>\n<p>\n    If you are still seeing the same error then you may be missing libraries required to install these modules or need to manually specify the module that is not found. if you are missing canvas you would install it like this.\n</p>\n<pre>npm install canvas</pre>"
   },
   "2017-07-26-unplayable-videos": {
      "date": "2017-07-26 18:36:01",
      "id": "2017-07-26-unplayable-videos",
      "page__heading": "<h1 class=\"page__heading\">\n    Unplayable videos\n</h1>",
      "title": "\n    Unplayable videos\n",
      "page__opening": "<p class=\"page__opening\">\n    Damaged or corrupted video files that cannot be viewed in the browser or in the OS directly\n</p>",
      "page__content": "<h2 id=\"learn\">\n    Incorrect Settings\n</h2>\n<ul>\n    <li>\n        Ensure that your settings are compatible with each other. For example you cannot use <b>MP4</b> as the recording file type if the <b>Recording Video Codec</b> is set to <b>libvpx.</b> libvpx is only for WebM.\n    </li>\n    <li>\n        If you are not recording audio is best to set it to <b>No Audio.</b> If you are recording it may perform best with <b>AAC</b> as the Audio Encoder.\n    </li>\n</ul>\n<h2>\n    User Intervention\n</h2>\n<p>\n    Some camera streams do not allow being cut in the middle of a recording. Which leads your last <b>MP4</b> recording to be unplayable. It is technically still all there it just has not been <b>\"closed\".</b> You can record <b>WebM</b> files to minimize this issue if you regularly switch modes.\n</p>"
   },
   "2017-07-27-why-arent-plugins-just-integrated": {
      "date": "2017-07-27 09:35:14",
      "id": "2017-07-27-why-arent-plugins-just-integrated",
      "page__heading": "<h1 class=\"page__heading\">\n    Why aren't plugins just integrated?\n</h1>",
      "title": "\n    Why aren't plugins just integrated?\n",
      "page__opening": "<p class=\"page__opening\">\n    Plugins are loaded separately from the main Shinobi application.\n</p>",
      "page__byline": "<p>\n    By : Moe Alam\n</p>",
      "page__content": "<p id=\"learn\">\n    Not everyone uses motion detection or object tracking and the libraries required can be bothersome to install, based on the OS. For example if I make shinobi-opencv.js a feature then everyone will be required to install OpenCV just to use basic features in Shinobi. This also allows us to swap the plugin with a custom one or run it on another machine entirely. Sharing the work between multiple machines can be a great way to optimize performance.\n</p>\n<p>\n    The added benefit is that if the plugin crashes it won't interfere with the main application and once the connection automatically returns it will operate as expected.\n</p>"
   },
   "2017-07-29-why-not-just-use-zoneminder": {
      "date": "2017-07-29 18:16:16",
      "id": "2017-07-29-why-not-just-use-zoneminder",
      "page__heading": "<h1 class=\"page__heading\">\n    Why not just use ZoneMinder\n</h1>",
      "title": "\n    Why not just use ZoneMinder\n",
      "page__opening": "<p class=\"page__opening\">\n    ZoneMinder is the most popular free open source CCTV platform.\n</p>",
      "page__byline": "<p>\n    By : Moe Alam\n</p>",
      "page__content": "<h2>\n    Before Reading\n</h2>\n<p>\n    <i>Please be aware this is all based on my experiences with ZoneMinder.&nbsp;Much of this can be seen as just an opinion. Whether it's a good one or not is up to you.</i>\n</p>\n<h2>\n    Firstly, Why does ZoneMinder matter to me?\n</h2>\n<p>\n    <i>I want to make a world class CCTV platform. One that anyone can use. I scoured the internet for months for a place to start and only finding ZoneMinder as the answer over and over. Even my own brother was suggesting it. After using it and studying the code for 2+ years I was met with frustration. Developer arrogance coupled with poorly written code.</i>\n</p>\n<p>\n    In short I spent a lot of time and energy on something that didn't work and It frustrated me.\n</p>\n<h2>\n    MJPEG streams are outdated\n</h2>\n<p>\n    With MJPEG you are opening a new stream every time you create an image with an MJPEG url. Even if you remove this element it will continue to eat resources from the server and client. Only way to deal with it currently is through an iframe, popup, or hard refresh.\n</p>\n<p>\n    <i>Shinobi addresses this with Websocket streams. As frames are captured by FFMPEG they are base64 encoded and sent to the client. Shinobi can also output HLS (m3u8), MJPEG (in an iframe), and JPEG (on a timer).</i>\n</p>\n<p>\n    MJPEG streams are limited in many browsers. About 6-8 Streams maximum. Unless you turn off this limitation in the browsers settings, but of course mobile doesn't normally have this option exposed to users.\n</p>\n<p>\n    <i>In Shinobi you don't have to worry about that with Bas64 or JPEG streams you can trick the browser into just letting you do it anyway. Base64 is technically using 1 pipe to the client, the Websocket. While JPEG is just refreshing an image on a timer.</i>\n</p>\n<h2>\n    JPEG Storage is awful\n</h2>\n<p>\n    Saving each frame as a separate file in JPEG format can have a seriously detrimental effect on storage space and the hardware itself.\n</p>\n<p>\n    <i>Shinobi saves to WebM and MP4 files. While MP4 takes a fair amount of space.. its level of CPU usage during encoding for H.264 streams is just amazing.</i>\n</p>\n<h2>\n    Using too many languages\n</h2>\n<p>\n    The platform uses Perl, PHP, JavaScript, C++, HTML, CSS, MySQL, and probably more. This makes it difficult to modify the code for other purposes.\n</p>\n<p>\n    <i>Shinobi uses JavaScript, HTML, CSS, and MySQL. Simple right? It should be.</i>\n</p>\n<h2>\n    Outdated methods\n</h2>\n<p>\n    While connected to the dashboard it will query the database for events every few minutes, continuously getting/counting the same events over and over.\n</p>\n<p>\n    <i>Shinobi uses Websockets to get real-time data about Videos and Events.</i>\n</p>\n<p>\n    For every camera a new process is created every time a viewer opens a stream. 1 Stream = 1 Process. So if you had 1 Camera with 3 Streams open, you would have 3 processes active for each viewer.\n</p>\n<p>\n    <i>Shinobi uses 1 process per camera for all viewers.</i>\n</p>\n<p>\n    Multiple windows and pages for simple things. For example the monitor settings window. It has multiple pages. Even though each page has a fixed set of options, <b>all inputs are present on the page. They are just hidden.</b> If they were going to do that they may as well have made it use JavaScript to show and hide fields appropriately. Rather than send a request to the server on each page change.\n</p>\n<p>\n    <i>Shinobi has it all in one window, which is loaded on dashboard load. The fields are populated based on the camera selection. Even then the camera details are stored in the memory of the client browser to easily load data without an additional request to the server.</i>\n</p>\n<p>\n    As mentioned previously ZoneMinder uses&nbsp;Perl, PHP and C++. These languages are powerful, no doubt. The issue is in their use. C++ will require building of components, which makes updating a pain. PHP is fully synchronous, which makes client operations a pain for you and for the system it runs on.\n</p>\n<p>\n    <i>Shinobi uses JavaScript, this allows users to simply overwrite the older Shinobi files with the new ones, restart the processes and you are updated. Since JavaScript is asynchronous and has the ability to pipe data, we are left with little overhead when it actually comes to the node application itself.</i>\n</p>\n<h2>\n    Telemetry (Remote User Tracking)\n</h2>\n<p>\n    Quoted from the source code \"This script collects usage information of the local system and sends it to the ZoneMinder development team. This data will be used to determine things like who and where our customers are, how big their systems are, the underlying hardware and operating system, etc.\" - <a href=\"https://github.com/ZoneMinder/ZoneMinder/blob/254fcbcef790c0db11cd845548cd0383b7660e90/scripts/zmtelemetry.pl.in\">ZoneMinder/scripts/zmtelemetry.pl.in</a>\n</p>\n<p>\n    <i>You can turn this feature off. Although it should have never been made in the first place or at least turned off by default. From a developer standpoint this a great idea but some people may not like their information being logged somewhere to be possibly stolen then used maliciously. Paranoid? perhaps. All that matters is there are a few who don't want it and may not realize it is there. We don't know if other parts of the code are sending other kinds of data. To even wonder is a bother. Shinobi has no such integration and it never will.</i>\n</p>\n<p>\n    <i>The added issue to this being a third party controls this data. The original author is not the one who stores it. Literally anyone can become a core member of the platform tomorrow and leak all the information 10 minutes after that.</i>\n</p>\n<h2>\n    Conclusion\n</h2>\n<p>\n    In less than a year Shinobi has more than half the features of ZoneMinder. I'm not special or trained in programming, I learned at home - in my mom's basement. When someone cares about something they will give their time and effort for that. I care about Shinobi, that is why it has progressed so quickly.\n</p>\n<p>\n    Protect what is precious to you as you live long and prosper.\n</p>\n<p>\n    Learn more about Shinobi on the <a href=\"http://shinobi.video/why\">Why</a> page.\n</p>\n<p>\n    See a comparison of features for&nbsp;<a href=\"/features#learn\">ZoneMinder to Shinobi</a>.\n</p>"
   },
   "2017-07-29-how-i-optimized-my-rtsp-camera": {
      "date": "2017-07-29 19:20:48",
      "id": "2017-07-29-how-i-optimized-my-rtsp-camera",
      "page__heading": "<h1 class=\"page__heading\">\n    How I optimized my RTSP camera\n</h1>",
      "title": "\n    How I optimized my RTSP camera\n",
      "page__opening": "<p class=\"page__opening\">\n    These settings worked with Grandstream GXV3610 and GXV3615.\n</p>",
      "page__byline": "<p>\n    By : Moe Alam\n</p>",
      "page__content": "<h2 id=\"learn\">\n    Update FFMPEG\n</h2>\n<p>\n    You should be on FFMPEG 3.x or greater for the best performance.\n</p>\n<h2>\n    Log in to your camera's internal settings\n</h2>\n<p>\n    You will need to access the camera's internal settings. This can either be done through the web browser or through a third party tool like an ONVIF Device Manager. Once you have access find and change these option to the settings shown as follows.\n</p>\n<ul>\n    <li>\n        <b>Framerate (FPS)</b> : High : 10 - 15 FPS, Low : 2-5 FPS\n    </li>\n    <li>\n        <b>I-frame interval</b> : 80\n    </li>\n    <li>\n        <b>Bit Rate Type</b> : CBR (Constant Bit Rate)\n    </li>\n    <li>\n        <b>Bit Rate</b> : between 256kbps - 500kbps\n    </li>\n</ul>\n<h2>\n    Settings in Shinobi\n</h2>\n<p>\n    For the input section I used:\n</p>\n<ul>\n    <li>\n        <b>RTSP Transport</b> : TCP\n    </li>\n    <li>\n        <b>Analyzation Duration</b> : 1000000\n    </li>\n    <li>\n        <b>Probe Size</b> : 1000000\n    </li>\n</ul>\n<p>\n    For the streaming section I used:\n</p>\n<ul>\n    <li>\n        <b>Stream Type :</b> HLS\n    </li>\n    <li>\n        <b>Video Codec</b> : copy\n    </li>\n    <li>\n        <b>Audio Codec</b> : AAC or No Audio\n    </li>\n</ul>\n<p>\n    For the recording section I used:\n</p>\n<ul>\n    <li>\n        <b>Video Codec</b> : copy\n    </li>\n    <li>\n        <b>Audio Codec</b> : AAC or No Audio\n    </li>\n</ul>\n<p>\n    Be aware audio recording is illegal in regions of the world. Please contact your local law enforcement if you are unsure.\n</p>\n<h2>\n    What I gained and What I lost\n</h2>\n<p>\n    I gained a lot of storage space. The file sizes <b>before</b> the change were around<b> 150mb to 300mb</b> for each 15 minute segment per camera. <b>After</b> the changes the files were around <b>40mb to 70mb</b> with minimal quality loss, if any.\n</p>\n<h2>\n    Where my cameras are and where my Shinobi is\n</h2>\n<p>\n    My cameras are located around <b>Vancouver, B.C., Canada</b>. The Shinobi server is running in <b>Paris, France</b> and the quality was good enough to catch a turf thief.\n</p>\n<h2>\n    List of ONVIF Device Managers\n</h2>\n<p>\n    If you have any to suggest please let me know in the comments below!\n</p>\n<ul>\n    <li>\n        <a download=\"odm-v2.2.250.msi\" href=\"https://s3.amazonaws.com/cloudcamio/odm-v2.2.250.msi\">Windows ONVIF Device Manager</a>\n    </li>\n</ul>\n<h2>\n    Experiencing artifacts and smearing?\n</h2>\n<p>\n    Check out \"<a href=\"http://shinobi.video/articles/2017-07-26-ways-to-resolve-smearing-smudging-streaking-melting-and-artifacts\">Ways to resolve smearing, smudging, streaking, melting, and artifacts</a>\".\n</p>"
   },
   "2017-07-29-earn-money-from-shinobi": {
      "date": "2017-07-29 20:22:26",
      "id": "2017-07-29-earn-money-from-shinobi",
      "page__heading": "<h1 class=\"page__heading\">\n    Earn Money from Shinobi\n</h1>",
      "title": "\n    Earn Money from Shinobi\n",
      "page__opening": "<p class=\"page__opening\">\n    Becoming an affiliate helps the development of Shinobi while giving you something for your effort.\n</p>",
      "page__byline": "<p>\n    By : Moe Alam\n</p>",
      "page__content": "<h2 id=\"learn\">\n    Become an affiliate\n</h2>\n<p>\n    Visit the client area and sign up for an <a href=\"http://billing.place/affiliates/\">Affiliate Account</a>. You can earn a percentage monthly from <a href=\"http://billing.place/cart/shinobi/\">support packages.</a>&nbsp;Just create a discount code and have users sign up with it.\n</p>\n<p>\n    Now sit back and let me do the work.\n</p>"
   },
   "2017-07-29-donate-and-contribute": {
      "date": "2017-07-29 20:30:08",
      "id": "2017-07-29-donate-and-contribute",
      "page__heading": "<h1 class=\"page__heading\">\n    Donate and Contribute\n</h1>",
      "title": "\n    Donate and Contribute\n",
      "page__opening": "<p class=\"page__opening\">\n    Help me keep Shinobi alive and well. No one great has ever done it alone.\n</p>",
      "page__byline": "<p>\n    By : Moe Alam\n</p>",
      "page__content": "<p>\n    A large chunk of the earnings I give to my family. People who spend their life for me <b>and through Shinobi all of you as well</b>. Please help me make the rest of my family's life comfortable the same way they are making mine and yours comfortable. <b>Without them I would not be here to give you Shinobi.</b>\n</p>\n<p>\n    Only Support Packages will add to the contribution meter.&nbsp;Can't do a monthly contribution? That's fine! Any amount helps!\n</p>\n<p>\n    When Shinobi reaches <b>$600</b> in contributions for the month <b>all ads will be removed for everyone.</b>\n</p>\n<ul>\n    <li>\n        <a href=\"https://www.paypal.me/ShinobiCCTV\">Donate by Paypal</a>\n    </li>\n    <li>\n        <a href=\"/support\">Support Packages</a>\n    </li>\n    <li>\n        <a href=\"https://www.patreon.com/moeiscool\">Patreon</a>\n    </li>\n    <li>\n        Bitcoin :&nbsp;1FvC7M8P9wVT1hXwHj8ugxpZj8JGfGyUDu\n    </li>\n</ul>\n<p>\n    Thank You to those already supporting! With you more time and effort can be put into Shinobi!\n</p>\n<p>\n    Cheers!\n</p>"
   },
   "2017-07-30-the-aim-of-shinobi": {
      "date": "2017-07-30 18:10:48",
      "id": "2017-07-30-the-aim-of-shinobi",
      "page__heading": "<h1 class=\"page__heading\">\n    The Aim of Shinobi\n</h1>",
      "title": "\n    The Aim of Shinobi\n",
      "page__opening": "<p class=\"page__opening\">\n    Why make Shinobi, Other solutions already exist.\n</p>",
      "page__byline": "<p>\n    By : Moe Alam\n</p>",
      "page__content": "<h2>\n    What I have is not a dream, it is an ambition\n</h2>\n<p>\n    I want to help people and one way I believed this could be done was to make a world class CCTV platform. One that anyone can use. Simply login to your account, add camera details, set options, and away you go. No client app installations. Viewing streams and recordings on your mobile device by simply opening a web page.\n</p>\n<p>\n    You should be able to view it on any device with a capable web browser. A base was needed to start with so I took to the internet for more answers.\n</p>\n<p>\n    After much searching one popular CCTV application born in 2003 was the primary choice but found it wasn't capable of fulfilling the role.\n</p>\n<p>\n    To get a detailed outline of the most popular solution check out \"<a href=\"/articles/2017-07-29-why-not-just-use-zoneminder\">Why not just use ZoneMinder</a>\".\n</p>\n<h2>\n    General issues with the present solutions\n</h2>\n<p>\n    You might find the current solutions with a mix of the problems listed below.\n</p>\n<ul>\n    <li>\n        Poorly written code\n    </li>\n    <li>\n        Missing key features\n    </li>\n    <li>\n        Written in obscure or old language\n    </li>\n    <li>\n        Ugly interface\n    </li>\n    <li>\n        Poor maintenance\n    </li>\n    <li>\n        Too expensive\n    </li>\n    <li>\n        Not open source\n    </li>\n    <li>\n        Requires client to install application\n    </li>\n    <li>\n        Does not run on multiple platforms\n    </li>\n</ul>\n<h2>\n    I want to eliminate these issues\n</h2>\n<p>\n    So I started the base of my vision. I worked on it for about 1 week alone in my dark room before I decided to one day pop open the working prototype on my brother's computer. He liked what he saw and asked me \"<b>Is this ZoneMinder?</b>\".. I gave him a big grin and said \"<b>nope</b>\".\n</p>\n<p>\n    I named it how I saw it. Shinobi (Ninja). One who watches from the shadows. Then threw it on Github and began my journey. I never really expected to make a replacement for the current solutions self hosted solutions. It sort of just happened.\n</p>\n<h2>\n    \"So wait.. Shinobi is not what you wanted to make in the first place?\"\n</h2>\n<p>\n    Initially, no. I planned to make a cloud hosted service that would be better and more cost effective than the rest. Something that could be relied upon globally.\n</p>\n<p>\n    Shinobi is meant to be the framework of this platform. As mentioned already, no usable solution existed. So I had to make one from the beginning.\n</p>\n<p>\n    In a sense I have met the criteria of what I wanted to do. I have achieved my goal, just in a different way. It is used around the world and generally it is pretty simple for how powerful it has become.\n</p>\n<h2>\n    Don't get me wrong, I'm enjoying the ride\n</h2>\n<p>\n    Shinobi has been an amazing experience so far. I have met amazing people, learned new things and did things I never imagined. The community made it this way. Node.js made it this way. My family made it this way... and so many more.\n</p>\n<p>\n    I am loving every moment that has been and I can't wait to see what's next. Thanks to everyone for helping make Shinobi what it is and what it will become.\n</p>\n<p>\n    Cheers!\n</p>"
   },
   "2017-08-01-nodemailer-is-no-longer-maintained": {
      "date": "2017-08-01 11:11:44",
      "id": "2017-08-01-nodemailer-is-no-longer-maintained",
      "page__heading": "<h1 class=\"page__heading\">\n    Nodemailer is no longer maintained\n</h1>",
      "title": "\n    Nodemailer is no longer maintained\n",
      "page__opening": "<p class=\"page__opening\">\n    Source :&nbsp;<a href=\"https://nodemailer.com/status/\" target=\"_blank\">https://nodemailer.com/status/</a>\n</p>",
      "page__byline": "<p>\n    By : Moe Alam\n</p>",
      "page__content": "<p id=\"learn\">\n    <i>\"In short, I am dumping the project. Most probably the current version 4.0.1 is going the be the last version of Nodemailer ever released. I don’t plan to add any new features nor fix any bugs or potential security issues. Nodemailer codebase is solid enough that there shouldn’t be major bugs, so it should be safe to continue using it for the foreseeable future.\" -&nbsp;andris</i>\n</p>\n<p>\n    Get the full article here&nbsp;<a href=\"https://nodemailer.com/status/\" target=\"_blank\">https://nodemailer.com/status/</a>\n</p>\n<h2>\n    Why Nodemailer matters to Shinobi\n</h2>\n<p>\n    I believe this to be an amazing project and it has helped me save a lot of time with Shinobi's mailing features.\n</p>\n<h2>\n    Why this issue bothers me\n</h2>\n<p>\n    The developer, <b>andris</b>, seems to have spent a lot of their effort on this project and it ended with users berating him and taking his earnings.\n</p>\n<p>\n    People like myself and andris give our time and effort for people we don't even know, this costs us money too. You can blame us for being considerate but if there weren't anyone like us then things would be a lot worse.\n</p>\n<p>\n    I too tried to make Shinobi a paid application and it ended with people just wasting my time. Ultimately hurting my performance in maintaining Shinobi.\n</p>\n<p>\n    Take what happened to Nodemailer as a reminder why we shouldn't just take without giving something in return.\n</p>\n<h2>\n    Why maintaining without the author is bad\n</h2>\n<p>\n    ZoneMinder is an application where the original author left and look at the result today. For more information check out \"<a href=\"/articles/2017-07-29-why-not-just-use-zoneminder\" target=\"_blank\">Why not just use ZoneMinder</a>\".\n</p>\n<p>\n    Making a program is similar to raising a child. It takes time and effort to do it right.\n</p>\n<p>\n    Please consider contributing to Shinobi to ensure it not only stays alive, so that the code is not destroyed by those not ready to pick up the mantle. This said not referring to ability but to the amount of care and for what purpose.\n</p>"
   },
   "2017-08-03-shinobi-on-the-go": {
      "date": "2017-08-03 16:40:36",
      "id": "2017-08-03-shinobi-on-the-go",
      "page__heading": "<h1 class=\"page__heading\">\n    Shinobi on the go\n</h1>",
      "title": "\n    Shinobi on the go\n",
      "page__opening": "<p class=\"page__opening\">\n    Using Shinobi on mobile is as easy as opening it in your web browser.\n</p>",
      "page__byline": "<p>\n    By : Moe Alam\n</p>",
      "page__content": "<p id=\"learn\">\n    Just open up Shinobi web panel in your <i>mobile browser</i> like <b>Safari, Chrome, or Edge.</b>\n</p>\n<h2>\n    What about an app on the home screen?\n</h2>\n<p>\n    Sure! Follow the steps below that are applicable to your device. This is how Shinobi is designed. It is meant to run on as many devices as possible.\n</p>\n<h2>\n    <b>iOS</b> (iPhone and iPad)\n</h2>\n<ol>\n    <li>\n        Open up <b>Safari</b> on your iOS device.\n    </li>\n    <li>\n        Navigate to the Shinobi panel that you want to the home screen.\n    </li>\n    <li>\n        Tap the <b>Share</b> button on the menu bar.\n    </li>\n    <li>\n        Tap on <b>Add to Home Screen.</b>\n    </li>\n    <li>\n        Set the display name for your <b>Shinobi icon (launcher).</b>\n    </li>\n    <li>\n        Tap on <b>Add</b> in the upper-right corner to add the shortcut to your home screen.\n    </li>\n    <li>\n        The icon will appear home screen.\n    </li>\n</ol>\n<h2>\n    <b>Android</b> (Google Mobile OS)\n</h2>\n<ol>\n    <li>\n        Launch <b>Chrome</b> for Android.\n    </li>\n    <li>\n        Navigate to the Shinobi panel that you want to the home screen.\n    </li>\n    <li>\n        Tap the menu button and tap <b>Add to homescreen.</b>\n    </li>\n    <li>\n        Set the display name for your <b>Shinobi icon (launcher).</b>\n    </li>\n    <li>\n        The icon will appear home screen.\n    </li>\n</ol>\n<h2>\n    <b>Windows</b> (Windows 8)\n</h2>\n<ol>\n    <li>\n        First, open the modern Internet Explorer browser.\n    </li>\n    <li>\n        Navigate to the Shinobi panel that you want to the home screen.\n    </li>\n    <li>\n        Pull up the app bar <i>— for example, by right-clicking or swiping up from the bottom of your screen</i>\n    </li>\n    <li>\n        Tap the <b>star icon</b>.then tap the <b>pin icon.</b>\n    </li>\n    <li>\n        Set the display name for your Shinobi icon (launcher).\n    </li>\n    <li>\n        Click <b>Pin to Start.</b>\n    </li>\n    <li>\n        The icon will appear as a <b>tile</b> on your <b>Start screen.</b>\n    </li>\n</ol>"
   },
   "2017-08-03-shinobi-ce-and-shinobi-pro": {
      "date": "2017-08-03 17:04:12",
      "id": "2017-08-03-shinobi-ce-and-shinobi-pro",
      "page__heading": "<h1 class=\"page__heading\">\n    Shinobi CE and Shinobi Pro\n</h1>",
      "title": "\n    Shinobi CE and Shinobi Pro\n",
      "page__opening": "<p class=\"page__opening\">\n    The difference between Shinobi Community Edition and Shinobi Professional is subtle but important.\n</p>",
      "page__byline": "<p>\n    By : Moe Alam\n</p>",
      "page__content": "<h2 id=\"learn\">\n    <b>Shinobi CE</b> (Community Edition)\n</h2>\n<p>\n    <a href=\"https://github.com/moeiscool/Shinobi\">Source Code for Shinobi CE</a>\n</p>\n<p>\n    Shinobi CE is the same code you know and love. It is still under GPLv3. This means you can use it for commercial purposes without permission. You must only make sure the Shinobi logo is always shown and that any copyright notices are always present and never removed.\n</p>\n<ul>\n    <li>\n        <b>Shinobi CE will only be updated for major updates and critical bug fixes.</b> Minor bugs will not be addressed directly to the Shinobi CE repository. They will be applied to Shinobi Pro and then merged to Shinobi CE during the next critical update.\n    </li>\n    <li>\n        <b>Support from developers will no longer be provided in the Shinobi CE community chat.</b> This includes me, Moe Alam. Support will only be provided to Shinobi Pro subscribers. Any support that is provided for Shinobi CE is done as a courtesy. The community has become too large and attention now must be prioritized.\n    </li>\n    <li>\n        <b>Pull requests will no longer be accepted to Shinobi CE.</b> Pull requests (volunteered code modifications) must be done through the <b>dev</b> branch in the <b>Pro</b> repository.\n    </li>\n</ul>\n<h2>\n    <b>Shinobi Pro</b> (Professional)\n</h2>\n<p>\n    <a href=\"https://github.com/ShinobiCCTV/Shinobi\">Source Code for Shinobi Pro</a><br> <a href=\"http://billing.place/cart/shinobi-pro/\">License Purchase</a>\n</p>\n<p>\n    Shinobi Pro is by nature the same in code. The main differences are noted below.\n</p>\n<ul>\n    <li>\n        <b>Gets regular updates</b> to the<b><i> dev</i></b> branch then when stable it is pushed to <b><i>master</i></b>.\n    </li>\n    <li>\n        Live Chat support in the<b> Shinobi Pro</b> community chat separate from the <b>Shinobi CE</b> Community Chat.\n    </li>\n    <li>\n        Released under the <i>Creative Commons v4.0</i> license<i>.</i>\n    </li>\n    <li>\n        Requires the purchase of a license to use in commercial locations.\n    </li>\n    <li>\n        Enabling <b>Pro</b> will need the purchase of a license key.\n    </li>\n    <li>\n        You can use Shinobi Pro for personal use without a license in non commercial locations.\n    </li>\n</ul>\n<p>\n    You will be invited to the private communtiy chat when your subscription becomes valid. If your subscription is cancelled you will be removed from the private community chat.\n</p>\n<h2>\n    What is commercial use or a commercial location?\n</h2>\n<ul>\n    <li>\n        <i>Locations that engage in the buying and selling of goods and services</i>\n    </li>\n    <li>\n        <i>Locations that engage in trading of any kind</i>\n    </li>\n    <li>\n        <i>Using Shinobi to watch a commercial location for anything other than educational purposes</i>\n    </li>\n</ul>\n<h2>\n    What stops people from just modifying the code to use Pro for free?\n</h2>\n<p>\n    <b>Trust.</b> I made this software, tracking usage is not a difficult task. I haven't begun doing it yet simply by choice. I can monitor the download traffic to Shinobi Pro so if it starts getting crazy with little contribution then things will get <i>legal</i>.\n</p>\n<h2>\n    I don't understand, Can I talk about this somewhere?\n</h2>\n<p>\n    Sure! You can personal message me on Discord or fill out the Contact form with any concerns you may have.\n</p>\n<p>\n    A few users felt it was their duty to post in the Issues section when it was explicitly stated the issues section is only for bugs with the software, Not personal opinions or general discussion.\n</p>\n<h2>\n    What about previous contributions by other users?\n</h2>\n<p>\n    <b>On the official Contributing page, which is actually linked to from the Github Wiki, it is stated :</b><br><i>\"All contributed code becomes the property of Shinobi. All contributors give permission to Shinobi and Shinobi developers to use the code however it is seen fit. This is agreed upon when making your first commit.\"</i>\n</p>\n<p>\n    I have written this as simple as possible. As much as it is a restricting policy it makes maintaining the application simple. The main premise of Shinobi is to keep things simple even when we are handling something complex.\n</p>\n<p>\n    <b>Don't agree with these rules?</b> Then don't commit or make a pull request to remove your code. Understand though that you have already accepted these guidelines and we reserve the right to reject the request if it is irreplaceable, as the code now belongs to Shinobi. Once a \"reversion request\" is reviewed and accepted we will get into changing the code to not use your specified snippets.\n</p>\n<h2>\n    But isn't the code mine, since I wrote it?\n</h2>\n<p>\n    In your fork it is, that is what the GPL license actually covers. But due to the notice I put on the website anything that is contributed becomes property of Shinobi.\n</p>\n<h2>\n    I suppose free is too expensive and reading the manual seems to be taboo. Can't win them all.\n</h2>"
   }
}
